app/controllers/posts_controller.rb

	def create
  	@post = Post.new(post_params)

  	@post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "lets hope this works"], ["created_at", "2016-01-12 14:15:25.106537"], ["title", "mr soft"], ["updated_at", "2016-01-12 14:15:25.106537"]]